[
    {
        "name": "Digital Atlas",
        "title": "Full-Stack Developer - Undergraduate Research",
        "company": "CSU STEM Pathways and Research Alliance (CSU-SPaRA)",
        "technologies": ["Javascript", "React", "React-Router", "Leaflet", "NodeJS", "Express", "SQLite", "HTML/CSS", "GeoJSON", "HTML/CSS", "Git"],
        "summary": "An interactive web-based digital atlas with an events menu and time-slider for a view through history",
        "description": "description",
        "image": "/LOLstats1.PNG",
        "bullets": ["Dynamically filtered and displayed GeoJSON border data to map using React-Leaflet based on the user selected year", "Utilized modern React best practices to optimize performance in handling program state and introduced interactivity to the map with features such as an updating menu on hover and zooming to the bounds of what is clicked", "Created an express server that retrieves geographic data from a MySQL database, then builds and serves a GeoJSON file to the client for display"]
    },
    {
        "name": "Lunar Semantic Segmentation",
        "title": "Machine Learning Engineer - Undergraduate Research",
        "company": "Computing Alliance of Hispanic Serving Institutions (CAHSI)",
        "technologies": ["Python", "TensorFlow", "Keras", "U-Net", "Semantic Segmentation", "Convolutional Neural Networks (CNN)", "Deep Learning"],
        "summary": "A deep learning model used for semantic segmentation in the lunar environment.",
        "description": "description",
        "image": "/LOLstats1.PNG",
        "bullets": ["Developed a model that creates segmentation masks for the lunar environment with classes differentiating the ground, sky, large rocks, and small rocks using U-Net and Tensorflow at 90% accuracy.", "Presented research in the Great Minds in Stem (GMiS) poster competition.", "The model consists of three encoder blocks (two 3x3 convolutions and maxpooling each), a 512-filter bottleneck, three mirrored decoder blocks, and is trained with sparse categorical cross-entropy"]
    },
    {
        "name": "League of Legends Stats Visualizer",
        "title": "Full-Stack Developer",
        "company": "LoL Stats",
        "technologies": ["Javascript", "React", "Nivo", "NodeJS", "Express", "MongoDB", "Mongoose", "Webpack", "Babel", "HTML/CSS", "Git"],
        "summary": "A proof of concept for a statistic visualizer for the video game League of Legends",
        "description": "description",
        "image": "/LOLstats1.PNG",
        "bullets": ["Built a full stack application that pulls data from the Riot Games API to display recent statistics.", "Application includes several graphs with Nivo to allow for users to easily interpret their recent performance and compare it to a number of benchmarks.", "Setup a RESTful API with Express to communicate with the front-end and dynamically render persistent data from a MongoDB database."]
    },
    {
        "name": "Back-End Refactor",
        "title": "Back-End Engineer",
        "company": "Congo Prime",
        "technologies": ["Javascript", "PostgreSQL", "Sequelize", "NodeJS", "New Relic", "K6", "EC2", "Git"],
        "summary": "A back end for an online marketplace scaled to handle realistic amounts of data/user traffic",
        "description": "description",
        "image": "/LOLstats1.PNG",
        "bullets": ["Implemented foreign-key column indexing to increase the read speeds on high-volume requests.", "Used K6 to simulate 1000 virtual users continuously hitting an endpoint and was able to handle over 700 rps when querying through a table of 50 million records.", "Optimized the seeding process of the database by writing to a CSV and copying the data to the database."]
    },
    {
        "name": "Portfolio Website",
        "title": "Front-End Developer",
        "company": "Robert Eusanio",
        "technologies": ["Javascript", "Vue", "HTML/CSS", "Netlify", "Git"],
        "summary": "A portfolio website for displaying personal achievements and experience",
        "description": "description",
        "image": "/LOLstats1.PNG",
        "bullets": ["test", "test", "test"]
    }
]